; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-1-5-7-226)
	(:domain driverlog)
	(:objects
	driver1 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p1-0 - location
	p1-2 - location
	p1-3 - location
	p2-0 - location
	)
	(:init
	(at driver1 s0)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s3)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s3)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s2)
	(at package2 s0)
	(at package3 s3)
	(at package4 s0)
	(at package5 s2)
	(at package6 s0)
	(at package7 s3)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 20)
	(= (time-to-walk p1-0 s1) 20)
	(= (time-to-walk s0 p1-0) 19)
	(= (time-to-walk p1-0 s0) 19)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 38)
	(= (time-to-walk p1-2 s1) 38)
	(= (time-to-walk s2 p1-2) 53)
	(= (time-to-walk p1-2 s2) 53)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 39)
	(= (time-to-walk p1-3 s1) 39)
	(= (time-to-walk s3 p1-3) 46)
	(= (time-to-walk p1-3 s3) 46)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 75)
	(= (time-to-walk p2-0 s2) 75)
	(= (time-to-walk s0 p2-0) 49)
	(= (time-to-walk p2-0 s0) 49)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 49)
	(= (time-to-drive s2 s1) 49)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 32)
	(= (time-to-drive s1 s0) 32)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 65)
	(= (time-to-drive s2 s0) 65)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 59)
	(= (time-to-drive s3 s0) 59)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 4)
	(= (time-to-drive s1 s3) 4)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 63)
	(= (time-to-drive s2 s3) 63)
	(= (fuel-used) 0)
)
	(:goal (and
	(at truck3 s1)
	(at truck4 s3)
	(at truck5 s3)
	(at package1 s2)
	(at package2 s1)
	(at package3 s2)
	(at package4 s1)
	(at package5 s1)
	(at package6 s0)
	(at package7 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver1 s0 p2-0)
   deleted: (at driver1 s0)
   added: (at driver1 p2-0)
   goals met: 4 of 10
2. (walk driver1 p2-0 s2)
   deleted: (at driver1 p2-0)
   added: (at driver1 s2)
   goals met: 4 of 10
3. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 10
4. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 4 of 10
5. (drive-truck truck3 s2 s1 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 0 to 539
   goals met: 5 of 10
6. (unload-truck package5 truck3 s1)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 10
7. (drive-truck truck3 s1 s0 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 539 to 859
   goals met: 5 of 10
8. (load-truck package2 truck3 s0)
   deleted: (at package2 s0)
   added: (in package2 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 10
9. (load-truck package4 truck3 s0)
   deleted: (at package4 s0)
   added: (in package4 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 5 of 10
10. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 859 to 1275
   goals met: 6 of 10
11. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 7 of 10
12. (unload-truck package4 truck3 s1)
   deleted: (in package4 truck3)
   added: (at package4 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 10
13. (drive-truck truck3 s1 s3 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   changed: (fuel-used) from 1275 to 1315
   goals met: 7 of 10
14. (load-truck package3 truck3 s3)
   deleted: (at package3 s3)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 7 of 10
15. (load-truck package7 truck3 s3)
   deleted: (at package7 s3)
   added: (in package7 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 7 of 10
16. (drive-truck truck3 s3 s2 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 1315 to 2134
   goals met: 7 of 10
17. (unload-truck package3 truck3 s2)
   deleted: (in package3 truck3)
   added: (at package3 s2)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 8 of 10
18. (drive-truck truck3 s2 s0 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 2134 to 2849
   goals met: 8 of 10
19. (unload-truck package7 truck3 s0)
   deleted: (in package7 truck3)
   added: (at package7 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 10
20. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 2849 to 3169
   goals met: 10 of 10
